---
type: CurtainCell
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# CurtainCell

`Autodesk.Revit.DB.CurtainCell` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CurveLoops | — | `public CurveArrArray CurveLoops { get ; }` |
| Property | PlanarizedCurveLoops | — | `public CurveArrArray PlanarizedCurveLoops { get ; }` |